backend/load-test.yaml
config:
  target: 'http://localhost:4000/graphql'
  phases:
    - duration: 60 # Duration of the test in seconds
      arrivalRate: 50 # Number of users per second

scenarios:
  - flow:
      - post:
          url: '/graphql'
          json:
            query: 'query UserDetails { getAllBusinessMen { name } }'